# AssetSet Properties

---
The AssetSet type exposes the following members.
| Name| Description
---|---|---
| IsEmpty|
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Size|
Top
#### Reference
AssetSet Class
Autodesk.Revit.DB.Visual Namespace